Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.DragHandle(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Transform)
This function is called when the RebarConstrainedHandle is dragged in canvas.
Remarks:
This function should only be implemented if the custom handle is draggable.
rebar:
The Rebar element that the handle was dragged.
moveTransform:
The transformation that was applied to the handle during the drag operation.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.IsDraggable(Autodesk.Revit.DB.Structure.Rebar)
This function returns true if the RebarConstrainedHandle is draggable in canvas, false otherwise.
rebar:
The Rebar element who owns this handle.
Returns:
Returns true if the RebarConstrainedHandle is draggable in canvas, false otherwise.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.HandleAllowsConstraintToCustomTarget
This function returns true if the RebarConstrainedHandle permits custom constraints to custom target.
Returns:
Returns true if the RebarConstrainedHandle permits custom constraints to custom target, false otherwise.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.GetPositiveDirectionForTargetRebarEdge(Autodesk.Revit.DB.Structure.Rebar,System.Int32,System.Int32)
This function computes the positive direction for the specified target.
This function should only be implemented if the custom handle allows constraint to other rebar.
targetRebar:
The Rebar target element.
barIndex:
The index of the bar in the target set for which the direction will be obtained.
edgeIndex:
The edge index of the target Rebar for which the direction will be obtained.
Returns:
Returns the positive direction of the target rebar edge.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.HandleAllowsConstraintToOtherRebarEdge
This function returns true if the RebarConstrainedHandle permits constraint 'ToOtherRebar' where target type is 'Edge', false otherwise.
Returns:
Returns true if the RebarConstrainedHandle permits constraint 'ToOtherRebar' where target type is 'Edge', false otherwise.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.HandleAllowsDistanceToHostEdgeOrCover
This function returns true if the RebarConstrainedHandle permits distance to host edge or host edge cover, false otherwise.
Remarks:
This function should only be implemented if the custom handle allows constraint to host edge or host edge cover.
If this function returns false, setting distance to target host edge or host edge cover will throw exception. Also, distance control will not be shown in the UI during the editing of the Rebar constraints.
Returns:
Returns true if the RebarConstrainedHandle permits distance, false otherwise.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.HandleAllowsConstraintToHostEdgeCover
This function returns true if the RebarConstrainedHandle permits constraint to host edge cover, false otherwise.
Returns:
Returns true if the RebarConstrainedHandle permits constraint to host edge cover, false otherwise.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.HandleAllowsConstraintToHostEdge
This function returns true if the RebarConstrainedHandle permits constraint to host edge, false otherwise.
Returns:
Returns true if the RebarConstrainedHandle permits constraint to host edge, false otherwise.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.HandleAllowsConstraintToHostFaceOrToCover
This function returns true if the RebarConstrainedHandle permits constraint to host face or to cover, false otherwise.
Returns:
Returns true if the RebarConstrainedHandle permits constraint to host face or to cover, false otherwise.

Autodesk.Revit.DB.Structure.ICustomHandleBehaviorProxy.HandleAllowsConstraintToSurface
This function returns true if the RebarConstrainedHandle permits constraint to surface, false otherwise.
Returns:
Returns true if the RebarConstrainedHandle permits constraint to surface, false otherwise.